{
  "job_titles": [
    "Software Engineering Manager",
    "Director of Software Engineering"
  ],
  "is_remote": true,
  "location": "Cleveland, OH",
  "distance": 20,
  "stop_words": [],
  "skill_words": [
    "Agile",
    "Software Development Lifecycle",
    "development team"
  ],
  "candidate_requirements": [],
  "resume": "AboutAbout\nDynamic technology leader with a proven track record in assembling and mentoring elite delivery teams, spearheading expansive technology projects, and enhancing team cohesion to achieve measurable outcomes. Recognized for a holistic expertise that encompasses project management, fostering software delivery excellence, driving sales growth, strategic planning, and organizational restructuring. Committed to innovation and results, excels in transforming challenges into opportunities.\n\nExperience\nLeadership Consultant / CTO, VP, DirectorLeadership Consultant / CTO, VP, Director\nJan 2019 - Present · 5 yrs 4 mos\nOVERVIEW:\nHold multiple roles and responsibilities as a Leadership Consultant. Coach, mentor, and transform technical leads into Engineering Managers and Directors, equipping them with the skills and mindset to lead and inspire their teams effectively.  Guide and motivate engineering leaders in creating alignment with business partners and leveraging the OKR framework to establish shared goals and strategic buy-in organization-wide.\n\nDirector, Product Engineering (2022) – Established Shared Delivery principles and processes across the organization. Create and execute strategies to achieve value stream efficiency and alignment objectives. Foster and execute product concepts from ideation to delivery. Coach and influence teams towards strong adherence to psychological safety and modern delivery practices.\n\nConsultant/Leadership Coach (2022) – Mentor engineers transitioning into leadership roles, with a focus on balancing a big-picture/business perspective with an engineering mindset. Coach leaders on strategy development/deployment and engineers on Agile technical practices. Evaluate software delivery capabilities and time-to-market.\n\nVice President of Digital (interim), (2020-2021) – Directed all IT functions, including recruitment, hiring, and performance management for all North America. Led a team of 4 Regional Directors. Created the IT strategy, including all performance metrics. Worked with HR and Finance to design and institute a new IT as a Shared Services organizational structure. Led the Dynamics 365 implementation.\n\nChief Technology Officer, (2019-2020) – Led a Digital Transformation that paved the way for a significant improvement in product delivery, including planning and delivery of a Digital Signing platform. Recruited, hired, and managed software developers. Ensured 100% compliance with HIPAA and CIS20. Reduced cycle times from 2 months to less than 1 week."
}